http-benchmarks/output/run-httpserv_effects-45000-1000.txt
Running 1m test @ http://localhost:8080
  24 threads and 1000 connections
  Thread calibration: mean lat.: 1386.086ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 1405.865ms, rate sampling interval: 5308ms
  Thread calibration: mean lat.: 1438.850ms, rate sampling interval: 5361ms
  Thread calibration: mean lat.: 1390.844ms, rate sampling interval: 5210ms
  Thread calibration: mean lat.: 1404.001ms, rate sampling interval: 5136ms
  Thread calibration: mean lat.: 1380.688ms, rate sampling interval: 5144ms
  Thread calibration: mean lat.: 1394.536ms, rate sampling interval: 5001ms
  Thread calibration: mean lat.: 1436.306ms, rate sampling interval: 5246ms
  Thread calibration: mean lat.: 1419.215ms, rate sampling interval: 5234ms
  Thread calibration: mean lat.: 1391.727ms, rate sampling interval: 5029ms
  Thread calibration: mean lat.: 1432.357ms, rate sampling interval: 5275ms
  Thread calibration: mean lat.: 1432.189ms, rate sampling interval: 5365ms
  Thread calibration: mean lat.: 1391.127ms, rate sampling interval: 5210ms
  Thread calibration: mean lat.: 1337.785ms, rate sampling interval: 5074ms
  Thread calibration: mean lat.: 1368.761ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 1324.766ms, rate sampling interval: 5029ms
  Thread calibration: mean lat.: 1329.368ms, rate sampling interval: 5042ms
  Thread calibration: mean lat.: 1121.037ms, rate sampling interval: 4034ms
  Thread calibration: mean lat.: 1253.498ms, rate sampling interval: 4845ms
  Thread calibration: mean lat.: 1246.997ms, rate sampling interval: 4907ms
  Thread calibration: mean lat.: 1378.888ms, rate sampling interval: 5124ms
  Thread calibration: mean lat.: 1256.328ms, rate sampling interval: 4513ms
  Thread calibration: mean lat.: 1230.387ms, rate sampling interval: 4796ms
  Thread calibration: mean lat.: 1201.698ms, rate sampling interval: 4612ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.77s     4.13s   18.60s    58.80%
    Req/Sec     1.35k    15.27     1.40k    73.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.72s 
 75.000%   13.24s 
 90.000%   15.47s 
 99.000%   17.45s 
 99.900%   18.10s 
 99.990%   18.38s 
 99.999%   18.53s 
100.000%   18.61s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1957.887     0.000000            1         1.00
    4139.007     0.100000       160925         1.11
    5525.503     0.200000       321992         1.25
    6909.951     0.300000       482564         1.43
    8314.879     0.400000       643448         1.67
    9723.903     0.500000       804192         2.00
   10428.415     0.550000       884695         2.22
   11132.927     0.600000       965429         2.50
   11829.247     0.650000      1045062         2.86
   12533.759     0.700000      1125761         3.33
   13238.271     0.750000      1206052         4.00
   13590.527     0.775000      1246040         4.44
   13950.975     0.800000      1286749         5.00
   14311.423     0.825000      1326547         5.71
   14688.255     0.850000      1366899         6.67
   15081.471     0.875000      1407474         8.00
   15278.079     0.887500      1427436         8.89
   15474.687     0.900000      1447165        10.00
   15679.487     0.912500      1467084        11.43
   15900.671     0.925000      1487551        13.33
   16130.047     0.937500      1507739        16.00
   16244.735     0.943750      1517309        17.78
   16375.807     0.950000      1527816        20.00
   16506.879     0.956250      1537958        22.86
   16637.951     0.962500      1547487        26.67
   16793.599     0.968750      1558047        32.00
   16875.519     0.971875      1563220        35.56
   16957.439     0.975000      1568109        40.00
   17039.359     0.978125      1572786        45.71
   17137.663     0.981250      1578120        53.33
   17235.967     0.984375      1582905        64.00
   17285.119     0.985938      1585140        71.11
   17350.655     0.987500      1587902        80.00
   17416.191     0.989062      1590496        91.43
   17481.727     0.990625      1592854       106.67
   17563.647     0.992188      1595487       128.00
   17596.415     0.992969      1596443       142.22
   17645.567     0.993750      1597785       160.00
   17694.719     0.994531      1599067       182.86
   17743.871     0.995313      1600294       213.33
   17793.023     0.996094      1601438       256.00
   17825.791     0.996484      1602168       284.44
   17858.559     0.996875      1602811       320.00
   17891.327     0.997266      1603383       365.71
   17940.479     0.997656      1604158       426.67
   17973.247     0.998047      1604642       512.00
   17989.631     0.998242      1604868       568.89
   18022.399     0.998437      1605283       640.00
   18055.167     0.998633      1605662       731.43
   18071.551     0.998828      1605831       853.33
   18104.319     0.999023      1606150      1024.00
   18120.703     0.999121      1606304      1137.78
   18153.471     0.999219      1606542      1280.00
   18169.855     0.999316      1606652      1462.86
   18186.239     0.999414      1606756      1706.67
   18219.007     0.999512      1606955      2048.00
   18235.391     0.999561      1607035      2275.56
   18251.775     0.999609      1607111      2560.00
   18268.159     0.999658      1607179      2925.71
   18284.543     0.999707      1607245      3413.33
   18300.927     0.999756      1607309      4096.00
   18317.311     0.999780      1607365      4551.11
   18333.695     0.999805      1607414      5120.00
   18350.079     0.999829      1607459      5851.43
   18350.079     0.999854      1607459      6826.67
   18366.463     0.999878      1607500      8192.00
   18382.847     0.999890      1607533      9102.22
   18399.231     0.999902      1607558     10240.00
   18399.231     0.999915      1607558     11702.86
   18415.615     0.999927      1607584     13653.33
   18431.999     0.999939      1607611     16384.00
   18431.999     0.999945      1607611     18204.44
   18448.383     0.999951      1607630     20480.00
   18448.383     0.999957      1607630     23405.71
   18464.767     0.999963      1607649     27306.67
   18464.767     0.999969      1607649     32768.00
   18481.151     0.999973      1607663     36408.89
   18481.151     0.999976      1607663     40960.00
   18481.151     0.999979      1607663     46811.43
   18497.535     0.999982      1607672     54613.33
   18497.535     0.999985      1607672     65536.00
   18497.535     0.999986      1607672     72817.78
   18513.919     0.999988      1607676     81920.00
   18530.303     0.999989      1607680     93622.86
   18530.303     0.999991      1607680    109226.67
   18546.687     0.999992      1607685    131072.00
   18546.687     0.999993      1607685    145635.56
   18546.687     0.999994      1607685    163840.00
   18563.071     0.999995      1607689    187245.71
   18563.071     0.999995      1607689    218453.33
   18563.071     0.999996      1607689    262144.00
   18563.071     0.999997      1607689    291271.11
   18579.455     0.999997      1607690    327680.00
   18579.455     0.999997      1607690    374491.43
   18595.839     0.999998      1607693    436906.67
   18595.839     0.999998      1607693    524288.00
   18595.839     0.999998      1607693    582542.22
   18595.839     0.999998      1607693    655360.00
   18595.839     0.999999      1607693    748982.86
   18595.839     0.999999      1607693    873813.33
   18595.839     0.999999      1607693   1048576.00
   18595.839     0.999999      1607693   1165084.44
   18595.839     0.999999      1607693   1310720.00
   18595.839     0.999999      1607693   1497965.71
   18612.223     0.999999      1607694   1747626.67
   18612.223     1.000000      1607694          inf
#[Mean    =     9772.274, StdDeviation   =     4129.305]
#[Max     =    18595.840, Total count    =      1607694]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1933256 requests in 1.00m, 3.94GB read
Requests/sec:  32222.49
Transfer/sec:     67.30MB

JSON Output:
{
	"requests": 1933256,
	"duration_in_microseconds": 59997102.00,
	"bytes": 4233830640,
	"requests_per_sec": 32222.49,
	"bytes_transfer_per_sec": 70567252.40,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 9723903
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 13238271
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 15474687
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 17448959
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 18104319
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 18382847
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 18530303
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 18612223
		}
	]
}